jaxrs-saml/cxf_sts_tutorial/client/src/main/resources/test.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP-ENV:Header xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
		<wsse:Security
			xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
			soap:mustUnderstand="1">
			<saml2:Assertion xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion"
				xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
				ID="_afa7ac8f-f843-4df5-86cc-1bd25133c487" IssueInstant="2014-12-09T19:41:24.931Z"
				Version="2.0" xsi:type="saml2:AssertionType">
				<saml2:Issuer>DoubleItSTSIssuer</saml2:Issuer>
				<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
					<ds:SignedInfo>
						<ds:CanonicalizationMethod
							Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
						<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" />
						<ds:Reference URI="#_afa7ac8f-f843-4df5-86cc-1bd25133c487">
							<ds:Transforms>
								<ds:Transform
									Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature" />
								<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
									<ec:InclusiveNamespaces
										xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="xs" />
								</ds:Transform>
							</ds:Transforms>
							<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
							<ds:DigestValue>hk2x95ttp2cVKNMZbxN47F6JcvA=</ds:DigestValue>
						</ds:Reference>
					</ds:SignedInfo>
					<ds:SignatureValue>oNZVsGkqV/S3Z+KvqARkL41tA+sHuIS1ef78zaotCUDu3jpfeDHLOLzS4EPoVmpgmdidrBZ5yBAFmbRvSniG1m1XNaS+yUg31ikb5qz84nVP6sZtskqFS2iaJ3Esorj07fspexp1GqLCh8K5sIWMD1HBNAEup1m7RbUGBoL4rHo=
					</ds:SignatureValue>
					<ds:KeyInfo>
						<ds:X509Data>
							<ds:X509Certificate>MIIDyDCCAzGgAwIBAgIJAL+muFEGT7kaMA0GCSqGSIb3DQEBBQUAMIGfMQswCQYDVQQGEwJVUzER
								MA8GA1UECBMITWFyeWxhbmQxEjAQBgNVBAcTCUJhbHRpbW9yZTExMC8GA1UEChMoU2FtcGxlIFNU
								UyBLZXkgLS0gTk9UIEZPUiBQUk9EVUNUSU9OIFVTRTESMBAGA1UEAxMJVG9tIFRva2VuMSIwIAYJ
								KoZIhvcNAQkBFhN0b210b2tlbkBzYW1wbGUuY29tMB4XDTExMTAwNzE2Mjg1N1oXDTIxMTAwNDE2
								Mjg1N1owgZ8xCzAJBgNVBAYTAlVTMREwDwYDVQQIEwhNYXJ5bGFuZDESMBAGA1UEBxMJQmFsdGlt
								b3JlMTEwLwYDVQQKEyhTYW1wbGUgU1RTIEtleSAtLSBOT1QgRk9SIFBST0RVQ1RJT04gVVNFMRIw
								EAYDVQQDEwlUb20gVG9rZW4xIjAgBgkqhkiG9w0BCQEWE3RvbXRva2VuQHNhbXBsZS5jb20wgZ8w
								DQYJKoZIhvcNAQEBBQADgY0AMIGJAoGBAOt5eoh1UkPJXpONsYXdjfeNvKLmXqkCvG8i71WOicLA
								2XxhCFHHeL97aPpzx0FavzdN2RMMTi5znS7A1bSSkzbgzrkmM/EP3FKIplPSFjNxIxb6suSHJjXB
								xto7GbW7X6uQ1OY//jPwO94eYy/my9NKTbUO9zqYx257oY/kiPjxAgMBAAGjggEIMIIBBDAdBgNV
								HQ4EFgQU3jcGsGCCu8KiPH/qrN4Gxt6X/JIwgdQGA1UdIwSBzDCByYAU3jcGsGCCu8KiPH/qrN4G
								xt6X/JKhgaWkgaIwgZ8xCzAJBgNVBAYTAlVTMREwDwYDVQQIEwhNYXJ5bGFuZDESMBAGA1UEBxMJ
								QmFsdGltb3JlMTEwLwYDVQQKEyhTYW1wbGUgU1RTIEtleSAtLSBOT1QgRk9SIFBST0RVQ1RJT04g
								VVNFMRIwEAYDVQQDEwlUb20gVG9rZW4xIjAgBgkqhkiG9w0BCQEWE3RvbXRva2VuQHNhbXBsZS5j
								b22CCQC/prhRBk+5GjAMBgNVHRMEBTADAQH/MA0GCSqGSIb3DQEBBQUAA4GBAE2PO9cvhbVpMLnj
								5WXPgeFXFz+4GJ5+oRO62oUmWCQoTZ7pEP8qVIG4k6QA+MDgCOPnlNQc3xm+g3GeIva4kPMaSFFC
								vr166isT/Q9IBmw/d73ySoeJYgCoF/wmFnsJB4IThBYWaXMcf6LJG5jV5LGgstiale2AtneA0Rbw
								2fI2
							</ds:X509Certificate>
						</ds:X509Data>
					</ds:KeyInfo>
				</ds:Signature>
				<saml2:Subject>
					<saml2:NameID
						Format="urn:oasis:names:tc:SAML:1.1:nameid-format:unspecified"
						NameQualifier="http://cxf.apache.org/sts">alice</saml2:NameID>
					<saml2:SubjectConfirmation
						Method="urn:oasis:names:tc:SAML:2.0:cm:holder-of-key">
						<saml2:SubjectConfirmationData
							xsi:type="saml2:KeyInfoConfirmationDataType">
							<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
								<ds:KeyValue>
									<ds:RSAKeyValue>
										<ds:Modulus>yd8hZ0w0cHL9aykbrNhSkrR1lkGrAfRG6DArzKmnps04uR6ONlHMHaJV1SLoxWIDwCOVKt3JOzC5
											DtkiexeTAeStmEi7ehDlsPzav5AmnNkZyVQ3yyaagsbGRogBlVbDimtAK8lX4LuYFkoVqnOS5iP+
											S8JHUsso95fS1EI6Ff0=
										</ds:Modulus>
										<ds:Exponent>AQAB</ds:Exponent>
									</ds:RSAKeyValue>
								</ds:KeyValue>
							</ds:KeyInfo>
						</saml2:SubjectConfirmationData>
					</saml2:SubjectConfirmation>
				</saml2:Subject>
				<saml2:Conditions NotBefore="2014-12-09T19:41:24.931Z"
					NotOnOrAfter="2014-12-09T20:11:24.931Z">
					<saml2:AudienceRestriction>
						<saml2:Audience>http://localhost:8080/doubleit/services/doubleit
						</saml2:Audience>
					</saml2:AudienceRestriction>
				</saml2:Conditions>
				<saml2:AttributeStatement>
					<saml2:Attribute Name="token-requestor" NameFormat="http://cxf.apache.org/sts">
						<saml2:AttributeValue xsi:type="xs:string">authenticated
						</saml2:AttributeValue>
					</saml2:Attribute>
				</saml2:AttributeStatement>
			</saml2:Assertion>
			<xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"
				Id="EK-84b065c0-7258-437f-9564-7edee3386c12">
				<xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5" />
				<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
					<wsse:SecurityTokenReference>
						<wsse:KeyIdentifier
							EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary"
							ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509SubjectKeyIdentifier">iEGo6e1lsMD+7Z4ZccJfjKVZDT4=</wsse:KeyIdentifier>
					</wsse:SecurityTokenReference>
				</ds:KeyInfo>
				<xenc:CipherData>
					<xenc:CipherValue>ZfxtuSk8OdQxtUXCo81Ou7Mj7FiK3Z4VVlVXuIdP/xAnTCjWmCpE2I2JdnSKvREQsabX2Iqp7z2OT6W3tNACBoULcnU793tISvW40ZkaWSoYI7Q73EfoMmTzs+ak45Nj+sj8Ifkk3qyefgykkzn1+wxzNApHuOLt3OhLSt1MYUo=
					</xenc:CipherValue>
				</xenc:CipherData>
				<xenc:ReferenceList>
					<xenc:DataReference URI="#ED-71315908-f916-4b8a-a3a2-0e891b1de308" />
				</xenc:ReferenceList>
			</xenc:EncryptedKey>
			<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
				Id="SIG-018c7ee9-7cde-4190-9729-cbb99ec8c386">
				<ds:SignedInfo>
					<ds:CanonicalizationMethod
						Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
						<ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"
							PrefixList="soap" />
					</ds:CanonicalizationMethod>
					<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" />
					<ds:Reference URI="#_2f3bf1ca-752f-43df-97fe-95f47b89c041">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<ec:InclusiveNamespaces
									xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="" />
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>MPMHag/2uoHVZ8tCftUtxcIU7l0=</ds:DigestValue>
					</ds:Reference>
				</ds:SignedInfo>
				<ds:SignatureValue>MUwj8mr5aVMMniq2TTkyDzcY3Dvc1HHioTi8WviIVZXQwQyVPd3UA+gdMleppy+bDelmYU0k+ChYdClPHevxqe2owewL+tuA9Syi4R8zJYbScYuaWAepFLZKLrkHUEQ22TM/6aP3bcbLY7QBaxKQLdBel/PhQLDUCuQ//tq7x84=
				</ds:SignatureValue>
				<ds:KeyInfo Id="KI-fa116588-ea81-4865-90ac-0d24f0a97d87">
					<ns4:SecurityTokenReference
						xmlns:ns4="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
						xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"
						wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLV2.0">
						<ns4:KeyIdentifier
							ValueType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLID">_afa7ac8f-f843-4df5-86cc-1bd25133c487
						</ns4:KeyIdentifier>
					</ns4:SecurityTokenReference>
				</ds:KeyInfo>
			</ds:Signature>
		</wsse:Security>
	</SOAP-ENV:Header>
	<soap:Body
		xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
		wsu:Id="_2f3bf1ca-752f-43df-97fe-95f47b89c041">
		<xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"
			Id="ED-71315908-f916-4b8a-a3a2-0e891b1de308" Type="http://www.w3.org/2001/04/xmlenc#Content">
			<xenc:EncryptionMethod
				Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc" />
			<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
				<wsse:SecurityTokenReference
					xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
					xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"
					wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey">
					<wsse:Reference URI="#EK-84b065c0-7258-437f-9564-7edee3386c12" />
				</wsse:SecurityTokenReference>
			</ds:KeyInfo>
			<xenc:CipherData>
				<xenc:CipherValue>ELGlZxzu2MykOxN5+XSfoaxYEU4yCbiDcBZM4Yu1tJ4Cw3iO1txYtS/+3QoJR/+exvY28xuzDTuDIATzto8e9pn7FozfdBoVUtcc88GaONsjSUmqdNXvOD5JFRM0e9aP962n68T2eF2MKC+uOAutnN7WSGV6k8OHwbTTPviEfs4=
				</xenc:CipherValue>
			</xenc:CipherData>
		</xenc:EncryptedData>
	</soap:Body>
</soap:Envelope>